In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("E:/DATA Science - My preparation/3_Data_analytics - Pandas/Data-files/Pandas - Q1 Sales.csv")

In [5]:
df.head()

     Country Region Sales Person    Date of Purchase   Total  Quantity
0      India  North         John    4/4/2018 0:00:00  100000       567
1         US  North         Bill  12/11/2017 0:00:00  120000      3000
2         UK  North       Thomas   5/12/2016 0:00:00  140000       345
3  Australia   East         John   6/20/2011 0:00:00  160000      1000
4     Africa   East         Bill   4/12/2011 0:00:00  180000       123

In [8]:
df['Date of Purchase']

# When you take entire column - Object

0       4/4/2018 0:00:00
1     12/11/2017 0:00:00
2      5/12/2016 0:00:00
3      6/20/2011 0:00:00
4      4/12/2011 0:00:00
5       7/5/2014 0:00:00
6      8/15/2015 0:00:00
7     11/19/2015 0:00:00
8      8/29/2017 0:00:00
9      5/10/2018 0:00:00
10     12/9/2016 0:00:00
11      7/4/2018 0:00:00
12     9/15/2017 0:00:00
13      9/2/2011 0:00:00
14     10/5/2014 0:00:00
15     1/24/2013 0:00:00
16      1/6/2017 0:00:00
17     8/28/2010 0:00:00
18     6/20/2014 0:00:00
19     1/29/2014 0:00:00
Name: Date of Purchase, dtype: object

In [9]:
df['Date of Purchase'][5]

# when you take particular value from column - string

'7/5/2014 0:00:00'

In [10]:
type(df['Date of Purchase'][5])

str

In [ ]:
# 1.  How to convert "string" ---> "Time-stamp"..?

In [11]:
pd.to_datetime(df['Date of Purchase'])[5]

Timestamp('2014-07-05 00:00:00')

In [ ]:
# 2.  How to assign Time-stamp to column(Date of purchase) in df..?

In [12]:
df['Date of Purchase'] = pd.to_datetime(df['Date of Purchase'])

In [13]:
df.head()

# Now - Date of Purchase(col) is converted as "Time-stamp"

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2018-04-04  100000       567
1         US  North         Bill       2017-12-11  120000      3000
2         UK  North       Thomas       2016-05-12  140000       345
3  Australia   East         John       2011-06-20  160000      1000
4     Africa   East         Bill       2011-04-12  180000       123

In [ ]:
# 3.1  How to extract year separately in df..?

In [15]:
pd.to_datetime(df['Date of Purchase']).dt.year

0     2018
1     2017
2     2016
3     2011
4     2011
5     2014
6     2015
7     2015
8     2017
9     2018
10    2016
11    2018
12    2017
13    2011
14    2014
15    2013
16    2017
17    2010
18    2014
19    2014
Name: Date of Purchase, dtype: int64

In [16]:
df['Year'] = pd.to_datetime(df['Date of Purchase']).dt.year

# Year-column is created & year extraction will stored in ("Year")

In [18]:
df.head()

     Country Region Sales Person Date of Purchase   Total  Quantity  Year
0      India  North         John       2018-04-04  100000       567  2018
1         US  North         Bill       2017-12-11  120000      3000  2017
2         UK  North       Thomas       2016-05-12  140000       345  2016
3  Australia   East         John       2011-06-20  160000      1000  2011
4     Africa   East         Bill       2011-04-12  180000       123  2011

In [ ]:
# 3.2  How to extract month separately in df..?

In [22]:
df['Month'] = pd.to_datetime(df['Date of Purchase']).dt.month

# Month-column is created & Month extraction will stored in ("Month")

In [23]:
df.head()

,Country,Region,Sales Person,Date of Purchase,Total,Quantity,Year,Month
0,India,North,John,2018-04-04,100000,567,2018,4
1,US,North,Bill,2017-12-11,120000,3000,2017,12
2,UK,North,Thomas,2016-05-12,140000,345,2016,5
3,Australia,East,John,2011-06-20,160000,1000,2011,6
4,Africa,East,Bill,2011-04-12,180000,123,2011,4

In [ ]:
# 3.3  How to extract month separately in df..?

In [24]:
df['Day'] = pd.to_datetime(df['Date of Purchase']).dt.day

# Day-column is created & Day extraction will stored in ("Day")

In [25]:
df.head()

,Country,Region,Sales Person,Date of Purchase,Total,Quantity,Year,Month,Day
0,India,North,John,2018-04-04,100000,567,2018,4,4
1,US,North,Bill,2017-12-11,120000,3000,2017,12,11
2,UK,North,Thomas,2016-05-12,140000,345,2016,5,12
3,Australia,East,John,2011-06-20,160000,1000,2011,6,20
4,Africa,East,Bill,2011-04-12,180000,123,2011,4,12

In [ ]:
# NOTE:-

# 1. Year:
#     Using extension --> .dt.year  in   pd.to_datetime() - function 
#     Extracts & Display ""year"" alone

# 2. Month:
#     Using extension --> .dt.month  in   pd.to_datetime() - function 
#     Extracts & Display ""month"" alone

# 3. Day:
#     Using extension --> .dt.day  in   pd.to_datetime() - function 
#     Extracts & Display ""Day"" alone